-- MySQL dump 10.11
--
-- Host: 192.168.71.76    Database: db_td_config
-- ------------------------------------------------------
-- Server version	5.0.51a-24+lenny2-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `t_web_email_template_data`
--

DROP TABLE IF EXISTS `t_web_email_template_data`;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
CREATE TABLE `t_web_email_template_data` (
  `email_template_data_id` int(11) NOT NULL auto_increment,
  `email_template_content_id` int(11) NOT NULL COMMENT '邮件模板内容配置ID',
  `data_date_type` enum('MINUTE','DAY','MONTH') default 'DAY' COMMENT '数据时间类型',
  `data_expr` varchar(512) NOT NULL COMMENT '数据表达式',
  `data_name` varchar(215) NOT NULL COMMENT '数据名称',
  `offset` smallint(6) NOT NULL default '0' COMMENT '时间偏移',
  `unit` varchar(16) NOT NULL COMMENT '数据单位',
  `in_table` tinyint(2) NOT NULL default '1' COMMENT '1：在表格中；0：不在',
  `in_graph` tinyint(2) NOT NULL default '1' COMMENT '1：在图像中；0：不在',
  PRIMARY KEY  (`email_template_data_id`)
) ENGINE=InnoDB AUTO_INCREMENT=113 DEFAULT CHARSET=utf8 COMMENT='邮件模板数据配置表';
SET character_set_client = @saved_cs_client;

--
-- Dumping data for table `t_web_email_template_data`
--

LOCK TABLES `t_web_email_template_data` WRITE;
/*!40000 ALTER TABLE `t_web_email_template_data` DISABLE KEYS */;
INSERT INTO `t_web_email_template_data` VALUES (1,1,'MINUTE','1:_olcnt_:_olcnt_:max:_zone_,_olcnt_|{0}','在线人数',0,'个',0,1),(2,2,'DAY','2:92|{0}','PCU',0,'个',1,1),(3,3,'DAY','1:_lgac_:_lgac_:ucount:|{0}','活跃用户数',0,'个',1,1),(4,4,'DAY','1:_lgac_:_lgac_:ucount::;2:21:1|{1}/{0}*100','活跃用户次日留存率',1,'%',1,1),(5,5,'DAY','1:_lgac_:_lgac_:ucount::;2:21:7|{1}/{0}*100','活跃用户7日留存率',7,'%',1,1),(6,6,'DAY','1:_lgac_:_lgac_:ucount::;2:21:14|{1}/{0}*100','活跃用户14日留存率',14,'%',1,1),(7,7,'DAY','1:_lgac_:_lgac_:ucount:;1:_logout_:_logout_:sum:_oltm_:|{1}/{0}','活跃用户平均游戏时长',0,'s',1,1),(8,8,'DAY','2:14:|{0}','新增用户数',0,'个',1,1),(9,9,'DAY','2:20:1|{0}*100','新增用户次日留存率',1,'%',1,1),(10,10,'DAY','2:20:7|{0}*100','新增用户7日留存率',7,'%',1,1),(11,11,'DAY','2:20:14|{0}*100','新增用户14日留存率',14,'%',1,1),(12,12,'DAY','2:347:|{0}/100','收入额（不含短信续费）',0,'元',1,1),(13,13,'DAY','2:348:|{0}/100','包月收入（不含短信续费）',0,'元',1,1),(14,14,'DAY','1:_acpay_:_buyitem_:sum:_amt_:|{0}/100','按条收入',0,'元',1,1),(15,15,'DAY','2:349:|{0}','付费用户数（不含短信续费）',0,'个',1,1),(16,16,'DAY','2:350:|{0}','包月付费用户数（不含短信续费）',0,'个',1,1),(17,17,'DAY','1:_acpay_:_buyitem_:ucount::|{0}','按条付费用户数',0,'个',1,1),(18,18,'DAY','2:347:;2:349:|{0}/{1}/100','Arppu值（不含短信续费）',0,'',1,1),(19,19,'DAY','2:349:;1:_lgac_:_lgac_:ucount:|{0}/{1}*100','付费率（不含短信续费）',0,'%',1,1),(20,20,'DAY','1:_acpay_:_acpay_:sum:_amt_:|{0}/100','收入总额（元）',0,'',0,0),(21,20,'DAY','1:_acpay_:_acpay_:ucount::|{0}','付费用户数',0,'',0,0),(22,20,'DAY','2:14:|{0}','新增用户数',0,'',0,0),(23,20,'DAY','2:20:1|{0}*100','新增用户次日留存率',1,'%',0,0),(24,20,'DAY','1:_lgac_:_lgac_:ucount:|{0}','活跃用户数',0,'',0,0),(25,20,'DAY','2:65:_acpay_|{0}','首次付费用户数',0,'',0,0),(26,20,'DAY','2:66:_acpay_|{0}/100','首次付费额（元）',0,'',0,0),(27,20,'DAY','2:62:|{0}*100','付费率',0,'%',0,0),(28,20,'DAY','1:_acpay_:_acpay_:sum:_amt_:;1:_acpay_:_acpay_:ucount::|{0}/{1}/100','Arppu值（元）',0,'',0,0),(29,21,'DAY','2:144:|{0}','当前包月用户数',0,'',1,1),(30,12,'DAY','1:_msremain_:_msremain_:sum:_amt_:|{0}/100','短信包月续费收入额',0,'元',1,0),(31,13,'DAY','1:_msremain_:_msremain_:sum:_amt_:|{0}/100','短信包月续费收入额',0,'元',1,0),(32,15,'DAY','1:_msremain_:_msremain_:ucount::|{0}','短信包月续费用户数',0,'',1,0),(33,16,'DAY','1:_msremain_:_msremain_:ucount::|{0}','短信包月续费用户数',0,'',1,0),(34,23,'DAY','1:_newac_:_newac_:ucount::|{0}','新建角色用户数',0,'个',1,1),(35,20,'DAY','2:144:|{0}','当前包月用户数',0,'',0,0),(36,24,'MONTH','2:71:_acpay_|{0}/100|1:1:1','付费总额(元)',13,'',1,0),(37,24,'MONTH','2:72:_acpay_|{0}|1:1:2','付费用户数',13,'',1,0),(38,24,'MONTH','2:71:_acpay_;2:72:_acpay_|{0}/{1}/100|1:1:3','arppu值',13,'',1,0),(39,25,'MONTH','2:445:|{0}/100|1:1:4','包月支付总额(不含短信包月续费)',13,'',1,0),(40,25,'MONTH','2:447:|{0}|1:2:5','包月支付用户数(不含短信包月续费)',13,'',1,0),(41,25,'MONTH','2:445:;2:447:|{0}/{1}/100|1:2:6','包月支付arppu值',13,'',1,0),(42,26,'MONTH','2:71:_buyitem_|{0}/100|1:1:7','按条支付总额',13,'',1,0),(43,26,'MONTH','2:72:_buyitem_|{0}|1:2:8','按条支付用户数',13,'',1,0),(44,26,'MONTH','2:71:_buyitem_;2:72:_buyitem_|{0}/{1}/100|1:2:9','按条支付arppu值',13,'',1,0),(45,27,'MONTH','2:75:|{0}|2:1:10','纯新增付费用户数',13,'',1,0),(46,27,'MONTH','2:81:|{0}|2:2:11','历史转化新增付费用户数',13,'',1,0),(47,27,'MONTH','2:83:|{0}|2:2:12','连续两月付费用户数',13,'',1,0),(48,27,'MONTH','2:85:|{0}|2:2:13','回流付费用户数',13,'',1,0),(49,27,'MONTH','2:75:|{0}|2:1:14','新增用户中的付费用户数',13,'',1,0),(50,27,'MONTH','2:77:|{0}|2:2:15','留存用户中的付费用户数',13,'',1,0),(51,27,'MONTH','2:79:|{0}|2:2:16','回流用户中的付费用户数',13,'',1,0),(52,28,'MONTH','2:72:_acpay_;2:11:|{0}/{1}*100|1:1:17','付费率',13,'%',1,0),(53,28,'MONTH','2:75:;2:115:|{0}/{1}*100|2:2:18','新增用户付费率',13,'%',1,0),(54,28,'MONTH','2:77:;2:145:1|{0}/{1}*100|2:2:19','留存用户付费率',13,'%',1,0),(55,28,'MONTH','2:79:;2:24:2|{0}/{1}*100|2:2:20','回流用户付费率',13,'%',1,0),(56,29,'MONTH','2:75:;2:72:_acpay_|{0}/{1}*100|2:1:21','纯新增付费用户占比',13,'%',1,0),(57,29,'MONTH','2:81:;2:72:_acpay_|{0}/{1}*100|2:2:22','历史转化新增付费用户占比',13,'%',1,0),(58,29,'MONTH','2:83:;2:72:_acpay_|{0}/{1}*100|2:2:23','连续两月付费用户占比',13,'%',1,0),(59,29,'MONTH','2:85:;2:72:_acpay_|{0}/{1}*100|2:2:24','回流付费用户占比',13,'%',1,0),(60,30,'MONTH','2:74:|{0}/100|2:1:25','纯新增付费用户付费额',13,'',1,0),(61,30,'MONTH','2:80:|{0}/100|2:2:26','历史转化新增付费用户付费额',13,'',1,0),(62,30,'MONTH','2:82:|{0}/100|2:2:27','连续两月付费用户付费额',13,'',1,0),(63,30,'MONTH','2:84:|{0}/100|2:2:28','回流付费用户付费额',13,'',1,0),(64,30,'MONTH','2:74:|{0}/100|2:1:29','新增用户付费额',13,'',1,0),(65,30,'MONTH','2:76:|{0}/100|2:2:30','留存用户付费额',13,'',1,0),(66,30,'MONTH','2:78:|{0}/100|2:2:31','回流用户付费额',13,'',1,0),(67,31,'MONTH','2:74:;2:75:|{0}/{1}/100|2:1:32','纯新增付费用户ARPPU值',13,'',1,0),(68,31,'MONTH','2:80:;2:81:|{0}/{1}/100|2:2:33','历史转化新增付费用户ARPPU值',13,'',1,0),(69,31,'MONTH','2:82:;2:83:|{0}/{1}/100|2:2:34','连续两月付费用户ARPPU值',13,'',1,0),(70,31,'MONTH','2:84:;2:85:|{0}/{1}/100|2:2:35','回流付费用户ARPPU值',13,'',1,0),(71,31,'MONTH','2:74:;2:75:|{0}/{1}/100|2:1:36','新增用户ARPPU值',13,'',1,0),(72,31,'MONTH','2:76:;2:77:|{0}/{1}/100|2:2:37','留存用户ARPPU值',13,'',1,0),(73,31,'MONTH','2:78:;2:79:|{0}/{1}/100|2:2:38','回流用户ARPPU值',13,'',1,0),(74,32,'MONTH','2:11:|{0}|1:1:1','活跃用户',13,'',1,0),(75,32,'MONTH','2:403:|{0}|1:1:2','有效活跃用户',13,'',1,0),(76,32,'MONTH','2:115:|{0}|1:1:3','新增活跃用户',13,'',1,0),(77,32,'MONTH','2:145:1|{0}|1:1:4','留存用户',13,'',1,0),(78,32,'MONTH','2:24:2|{0}|1:1:5','回流用户',13,'',1,0),(79,33,'MONTH','2:115:;2:11:|{0}/{1}*100|2:2:6','新增活跃用户占比',13,'%',1,0),(80,33,'MONTH','2:145:1;2:11:|{0}/{1}*100|2:2:7','留存用户占比',13,'%',1,0),(81,33,'MONTH','2:24:2;2:11:|{0}/{1}*100|2:2:8','回流用户占比',13,'%',1,0),(82,34,'MONTH','2:30:1|{0}|1:1:9','流失用户',13,'',1,0),(83,34,'MONTH','2:415:|{0}|2:1:10','上月新增活跃用户本月流失数',13,'',1,0),(84,34,'MONTH','2:416:|{0}|2:2:11','上月留存用户本月流失数',13,'',1,0),(85,34,'MONTH','2:417:|{0}|2:2:12','上月回流用户本月流失数',13,'',1,0),(86,35,'MONTH','2:30:1;2:11:|{0}/{1}*100|3:1:13','流失率',14,'%',1,0),(87,35,'MONTH','2:415:;2:115:|{0}/{1}*100|3:2:14','上月新增活跃用户本月流失率',14,'%',1,0),(88,35,'MONTH','2:416:;2:145:1|{0}/{1}*100|3:2:15','上月留存用户本月流失率',14,'%',1,0),(89,35,'MONTH','2:417:;2:24:2|{0}/{1}*100|3:2:16','上月回流用户本月流失率',14,'%',1,0),(90,36,'MONTH','2:332:_all_|{0}|1:1:17','PCU',13,'',1,0),(91,36,'MONTH','2:404:|{0}|1:1:19','ACU',13,'',1,0),(92,37,'MONTH','2:405:|{0}|2:1:20','活跃用户日平均在线时长',13,'',1,0),(93,37,'MONTH','2:406:|{0}|2:2:21','付费用户日平均在线时长',13,'',1,0),(94,37,'MONTH','2:407:|{0}|2:2:22','新增用户日平均在线时长',13,'',1,0),(95,37,'MONTH','2:408:|{0}|2:2:23','留存用户日平均在线时长',13,'',1,0),(96,37,'MONTH','2:409:|{0}|2:2:24','回流用户日平均在线时长',13,'',1,0),(97,38,'MONTH','2:410:|{0}|2:1:25','活跃用户月平均登录天数',13,'',1,0),(98,38,'MONTH','2:411:|{0}|2:2:26','付费用户平均登录天数',13,'',1,0),(99,38,'MONTH','2:412:|{0}|2:2:27','新增用户月平均登录天数',13,'',1,0),(100,38,'MONTH','2:413:|{0}|2:2:28','留存用户月平均登录天数',13,'',1,0),(101,38,'MONTH','2:414:|{0}|2:2:29','回流用户月平均登录天数',13,'',1,0),(102,39,'MONTH','2:71:_acpay_|{0}/100','付费总额(元)',1,'',1,0),(103,39,'MONTH','2:72:_acpay_|{0}','付费用户数',1,'',1,0),(104,39,'MONTH','2:348:|{0}/100','包月支付总额(不含短信包月续费)',1,'',1,0),(105,39,'MONTH','2:350:|{0}','包月支付用户数(不含短信包月续费)',1,'',1,0),(106,39,'MONTH','2:71:_buyitem_|{0}/100','按条支付总额',1,'',1,0),(107,39,'MONTH','2:72:_buyitem_|{0}','按条支付用户数',1,'',1,0),(108,40,'MONTH','2:11:|{0}','活跃用户',1,'',1,0),(109,40,'MONTH','2:403:|{0}','有效活跃用户',1,'',1,0),(110,40,'MONTH','2:115:|{0}','新增活跃用户',1,'',1,0),(111,40,'MONTH','2:145:1|{0}','留存用户',1,'',1,0),(112,40,'MONTH','2:24:2|{0}','回流用户',1,'',1,0);
/*!40000 ALTER TABLE `t_web_email_template_data` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2015-04-01  2:27:19
